docs/bench_full.txt
ERROR: failed to fetch CONFIG from 127.0.0.1:6379
WARN: could not fetch server CONFIG
====== SET ======
  10000 requests completed in 3.47 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.01% <= 1.3 milliseconds
0.02% <= 1.4 milliseconds
0.05% <= 1.5 milliseconds
0.08% <= 1.6 milliseconds
0.18% <= 1.7 milliseconds
0.26% <= 1.8 milliseconds
0.36% <= 1.9 milliseconds
0.46% <= 2 milliseconds
2.08% <= 3 milliseconds
3.30% <= 4 milliseconds
5.32% <= 5 milliseconds
7.19% <= 6 milliseconds
9.82% <= 7 milliseconds
13.31% <= 8 milliseconds
18.01% <= 9 milliseconds
23.15% <= 10 milliseconds
28.86% <= 11 milliseconds
35.82% <= 12 milliseconds
42.00% <= 13 milliseconds
47.11% <= 14 milliseconds
52.89% <= 15 milliseconds
58.21% <= 16 milliseconds
62.37% <= 17 milliseconds
65.44% <= 18 milliseconds
67.78% <= 19 milliseconds
69.95% <= 20 milliseconds
71.98% <= 21 milliseconds
73.86% <= 22 milliseconds
75.76% <= 23 milliseconds
77.54% <= 24 milliseconds
79.55% <= 25 milliseconds
81.67% <= 26 milliseconds
84.53% <= 27 milliseconds
86.35% <= 28 milliseconds
87.64% <= 29 milliseconds
88.67% <= 30 milliseconds
90.01% <= 31 milliseconds
90.99% <= 32 milliseconds
91.76% <= 33 milliseconds
92.68% <= 34 milliseconds
93.58% <= 35 milliseconds
94.48% <= 36 milliseconds
94.79% <= 37 milliseconds
95.01% <= 38 milliseconds
95.22% <= 39 milliseconds
95.64% <= 40 milliseconds
96.31% <= 41 milliseconds
96.98% <= 42 milliseconds
97.38% <= 43 milliseconds
98.08% <= 44 milliseconds
98.34% <= 45 milliseconds
98.53% <= 46 milliseconds
98.69% <= 47 milliseconds
99.12% <= 48 milliseconds
99.19% <= 49 milliseconds
99.49% <= 50 milliseconds
99.70% <= 51 milliseconds
99.78% <= 52 milliseconds
99.85% <= 53 milliseconds
99.88% <= 55 milliseconds
99.91% <= 56 milliseconds
99.97% <= 57 milliseconds
100.00% <= 58 milliseconds
2878.53 requests per second

====== GET ======
  10000 requests completed in 2.19 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  multi-thread: no

0.20% <= 1 milliseconds
0.45% <= 2 milliseconds
0.58% <= 3 milliseconds
0.63% <= 4 milliseconds
0.78% <= 5 milliseconds
3.19% <= 6 milliseconds
24.50% <= 7 milliseconds
62.23% <= 8 milliseconds
75.17% <= 9 milliseconds
77.22% <= 10 milliseconds
77.95% <= 11 milliseconds
78.61% <= 12 milliseconds
79.50% <= 13 milliseconds
80.25% <= 14 milliseconds
80.72% <= 15 milliseconds
81.18% <= 16 milliseconds
81.40% <= 17 milliseconds
82.30% <= 18 milliseconds
83.80% <= 19 milliseconds
85.63% <= 20 milliseconds
87.32% <= 21 milliseconds
88.74% <= 22 milliseconds
89.71% <= 23 milliseconds
90.40% <= 24 milliseconds
91.78% <= 25 milliseconds
93.20% <= 26 milliseconds
94.50% <= 27 milliseconds
95.39% <= 28 milliseconds
96.34% <= 29 milliseconds
96.85% <= 30 milliseconds
97.22% <= 31 milliseconds
97.43% <= 32 milliseconds
97.55% <= 33 milliseconds
97.88% <= 34 milliseconds
97.97% <= 35 milliseconds
98.09% <= 36 milliseconds
98.27% <= 37 milliseconds
98.52% <= 38 milliseconds
98.76% <= 39 milliseconds
99.02% <= 40 milliseconds
99.15% <= 41 milliseconds
99.28% <= 42 milliseconds
99.62% <= 43 milliseconds
99.80% <= 44 milliseconds
99.97% <= 45 milliseconds
100.00% <= 45 milliseconds
4562.04 requests per second